workshops/VersionControlUsingGit/README.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Version Control Using Git</title>
<meta name="author" content="Compro Prasad"/>
<link rel="stylesheet" href="../../reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="../../reveal.js/css/theme/black.css" id="theme"/>

<link rel="stylesheet" href="../custom.css"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1 class="title">Version Control Using Git</h1>
</section>

<section>
<section id="slide-org9780b62">
<h2 id="org9780b62">Prerequisites</h2>
<p>
Basic terminal commands
</p>

</section>
</section>
<section>
<section id="slide-org8d74e46">
<h2 id="org8d74e46">Test</h2>
<div id="test"></div>

</section>
</section>
<section>
<section id="slide-orgffe6bde">
<h2 id="orgffe6bde">Imagining a world without version control systems</h2>
<div class="outline-text-2" id="text-orgffe6bde">
</div>
</section>
<section id="slide-org2074930">
<h3 id="org2074930">Team members keep different copies of the same project</h3>
</section>
<section id="slide-orge6fc416">
<h3 id="orge6fc416">Using a messaging service to send files that were changed</h3>
</section>
<section id="slide-orge00c140">
<h3 id="orge00c140">The other person spends some time reviewing the changes</h3>
</section>
<section id="slide-org82c6297">
<h3 id="org82c6297">Manually merge the code</h3>
</section>
<section id="slide-orge787e47">
<h3 id="orge787e47">More back and forth on messaging services</h3>
</section>
<section id="slide-orgacf613c">
<h3 id="orgacf613c">On completion the boss takes the credit from his co-workers</h3>
</section>
<section id="slide-orga8611f6">
<h3 id="orga8611f6">Time passes</h3>
</section>
<section id="slide-org07aa432">
<h3 id="org07aa432">Code breaks</h3>
</section>
<section id="slide-org96c0aff">
<h3 id="org96c0aff">No track of changes</h3>
</section>
<section id="slide-orgd05be5b">
<h3 id="orgd05be5b">Code needs fixing or write the project from scratch</h3>
</section>
<section id="slide-org3935417">
<h3 id="org3935417">Vicious loop begins</h3>

</section>
</section>
<section>
<section id="slide-org703dedd">
<h2 id="org703dedd">Aim of VC Systems</h2>
<ul>
<li class="fragment appear">Can keep multiple working states with the help of branches</li>
<li class="fragment appear">Can help in reverting to any change made in the past</li>
<li class="fragment appear">Helps in merging two different branches</li>
<li class="fragment appear">Retains the time and author of a set of changes</li>
<li class="fragment appear">Provides an API to query software history</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgd2d8f79">
<h2 id="orgd2d8f79">Key terms</h2>
<ul>
<li class="fragment appear">State / Commit / Changeset</li>
<li class="fragment appear">Branch</li>
<li class="fragment appear">Remote</li>

</ul>

</section>
</section>
<section>
<section id="slide-org69803e3">
<h2 id="org69803e3">Note</h2>
<p>
Git commands only work when you are currently inside a directory
having the <code>.git/</code> subdirectory.
</p>

</section>
<section id="slide-org2099cfc">
<h3 id="org2099cfc">Dirs where <code>git</code> commands work</h3>
<p>
If a <code>.git/</code> dir is at <code>~/projects/favproject/.git/</code> then you can run <code>git</code> commands
from:
</p>
<ul>
<li><code>~/projects/favproject/</code> or</li>
<li><code>~/projects/favproject/subdir/</code></li>

</ul>

</section>
<section id="slide-org7c893b0">
<h3 id="org7c893b0">Dirs where <code>git</code> commands work</h3>
<p>
If a <code>.git/</code> dir is at <code>~/projects/favproject/.git/</code> then you cannot run <code>git</code> from:
</p>
<ul>
<li><code>~/</code> or</li>
<li><code>~/favproject/</code> or</li>
<li><code>~/projects/favproject/.git/</code></li>

</ul>


</section>
</section>
<section>
<section id="slide-orgc235afe">
<h2 id="orgc235afe">Lets get started</h2>
<p>
Open terminal and create a new Git repository
</p>
<div class="org-src-container">

<pre class="src src-shell">git init ~/newproject  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">make .git/</span>
<span style="color: #4f97d7;">cd</span> ~/newproject
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Now we can run git commands</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orga455ce7">
<h2 id="orga455ce7">Setting up Author details</h2>
<p>
One time setup:
</p>
<div class="org-src-container">

<pre class="src src-shell">git config --global user.name  <span style="color: #2d9574;">'Ratan Tata'</span>
git config --global user.email <span style="color: #2d9574;">'ratantata@tata.com'</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgcdd81c4">
<h2 id="orgcdd81c4">Set up <code>$EDITOR</code></h2>
<div class="org-src-container">

<pre class="src src-shell"><span style="color: #7590db;">EDITOR</span>=emacs
</pre>
</div>
<p>
You can use the following in your <code>~/.profile</code> or <code>~/.bashrc</code>
</p>
<div class="org-src-container">

<pre class="src src-shell"><span style="color: #4f97d7;">export</span> <span style="color: #7590db;">EDITOR</span>=emacs
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgcccb6dc">
<h2 id="orgcccb6dc">A <code>Hello, World!</code> program in Python</h2>
<p>
<code>hello.py</code>:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"Hello, World!"</span>)
</pre>
</div>
<p>
Running the script:
</p>
<div class="org-src-container">

<pre class="src src-shell">python3 hello.py
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgb21bc86">
<h2 id="orgb21bc86">State</h2>
<p>
A <b>state</b> comprises of the <i>changes</i>, <i>timestamp</i>, <i>author</i>, <i>id</i> and <i>parent id</i>.
</p>

</section>
</section>
<section>
<section id="slide-org6f981af">
<h2 id="org6f981af">Creating new states/commits</h2>
<ul>
<li class="fragment appear">First, select which changes will be added to the state</li>
<li class="fragment appear">The <i>unselected</i> ones are part of Git’s <b>unstaged</b> changes</li>
<li class="fragment appear">The <i>selected</i> ones are part of Git’s <b>staged</b> changes</li>
<li class="fragment appear">Once the selection is done we can <b>commit</b> the changes</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgb0ecf01">
<h2 id="orgb0ecf01"><code>git status</code></h2>
<p>
Check if files were changed since the last commit. It shows:
</p>
<ul>
<li class="fragment appear">Selected/Staged files</li>
<li class="fragment appear">Unselected/Unstaged files</li>
<li class="fragment appear">Unknown/Untracked files</li>

</ul>

</section>
</section>
<section>
<section id="slide-org8eda14d">
<h2 id="org8eda14d">Ignoring useless files</h2>
<p>
To ignore some files we need to add a file called <code>.gitignore</code>:
</p>
<pre class="example" id="org4c68d5b">
*.pyc
__pycache__/
</pre>

</section>
</section>
<section>
<section id="slide-org3c57e9d">
<h2 id="org3c57e9d">What files are good to ignore?</h2>
<ul>
<li class="fragment appear">Binaries</li>
<li class="fragment appear">External dependencies</li>
<li class="fragment appear">Build outputs</li>
<li class="fragment appear">Cache</li>
<li class="fragment appear">Databases</li>

</ul>

</section>
</section>
<section>
<section id="slide-org39338f8">
<h2 id="org39338f8">How to select/stage files</h2>
<div class="org-src-container">

<pre class="src src-shell">git add hello.c   <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">add to staging area</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgd47f9e7">
<h2 id="orgd47f9e7">How to unstage files</h2>
<div class="org-src-container">

<pre class="src src-shell">git reset HEAD -- hello.c
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org54b06c3">
<h2 id="org54b06c3">Commiting the state</h2>
<p>
Add the state to the history:
</p>
<div class="org-src-container">

<pre class="src src-shell">git commit    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Opens your $EDITOR</span>
</pre>
</div>
<p>
Then type in an appropriate message. Save and exit.
</p>

</section>
</section>
<section>
<section id="slide-orgc702fe7">
<h2 id="orgc702fe7">Tip</h2>
<p class="fragment (appear)">
<b>Keep your changes short and commit messages descriptive.</b>
</p>
<p class="fragment (appear)">
It is hard to achieve but start from now and hopefully you will start to embrace
it and make others happy.
</p>
<p class="fragment (appear)">
<b>Commit often</b>
</p>
<p class="fragment (appear)">
This will help you achieve the above.
</p>

</section>
</section>
<section>
<section id="slide-org351021c">
<h2 id="org351021c">Branch</h2>
<ul>
<li class="fragment appear">After commiting, the states become a part of a branch.</li>
<li class="fragment appear">The default branch name is <code>master</code>.</li>
<li class="fragment appear">Helps to create different timelines.</li>
<li class="fragment appear">Technically, it is a pointer to specific commits.</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgb791a8f">
<h2 id="orgb791a8f">List all branches</h2>
<div class="org-src-container">

<pre class="src src-shell">git branch -a
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org13aaf40">
<h2 id="org13aaf40">Creating a new branch</h2>
<div class="org-src-container">

<pre class="src src-shell">git branch test  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">branch from current commit</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org275e872">
<h2 id="org275e872">Switching to a branch</h2>
<div class="org-src-container">

<pre class="src src-shell">git checkout test
</pre>
</div>
<p>
Now the commits will be added to <code>test</code> branch.
</p>

</section>
</section>
<section>
<section id="slide-org10a9e14">
<h2 id="org10a9e14"><code>HEAD</code></h2>
<ul>
<li class="fragment appear"><code>HEAD</code> is a special branch</li>
<li class="fragment appear">Wherever you go <code>HEAD</code> follows you</li>
<li class="fragment appear">When you <code>checkout</code> to a commit/branch you change position of <code>HEAD</code></li>
<li class="fragment appear">When you add a new commit, <code>HEAD</code> moves forward along with the branch to which
<code>HEAD</code> points to</li>

</ul>

</section>
</section>
<section>
<section id="slide-org72eac8b">
<h2 id="org72eac8b">Change in program</h2>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">greetings</span>(name):
    <span style="color: #4f97d7; font-weight: bold;">print</span>(f<span style="color: #2d9574;">"Hello, </span>{name}<span style="color: #2d9574;">!"</span>)

<span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">__name__</span> == <span style="color: #2d9574;">'__main__'</span>:
    <span style="color: #4f97d7; font-weight: bold;">import</span> sys
    greetings(sys.argv[1])
</pre>
</div>
<p>
Running the program:
</p>
<div class="org-src-container">

<pre class="src src-shell">python3 hello.py <span style="color: #2d9574;">"Ratan Tata"</span>
</pre>
</div>

<pre class="example">
Hello, World!
</pre>

</section>
</section>
<section>
<section id="slide-org614f9b7">
<h2 id="org614f9b7">Then?</h2>
<ol>
<li>Check if you made any changes</li>
<li>Select/Add files</li>
<li>Commit</li>

</ol>

</section>
</section>
<section>
<section id="slide-org2c0a9e3">
<h2 id="org2c0a9e3">View the log</h2>
<div class="org-src-container">

<pre class="src src-shell">git log --graph --decorate --abbrev-commit --oneline
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org0999a8e">
<h2 id="org0999a8e">Thank you</h2>
<script type="text/javascript" src="canvas.js"></script>
</section>
</section>
</div>
</div>
<script src="../../reveal.js/lib/js/head.min.js"></script>
<script src="../../reveal.js/js/reveal.js"></script>
<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
mouseWheel: false,
fragmentInURL: false,
hashOneBasedIndex: false,
pdfSeparateFragments: true,

overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'slide', // see README of reveal.js for options
transitionSpeed: 'default',

// Optional libraries used to extend reveal.js
dependencies: [
 { src: '../../reveal.js/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: '../../reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: '../../reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: '../../reveal.js/plugin/search/search.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: '../../reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } }]

});
</script>
</body>
</html>
